; domain
; Block Words Domain
; Blocks World with 6 lettered blocks that must be stacked to spell a word.
; Based on Ramirez & Geffner (AAAI-10) Block Words domain.
; Each block has a letter; goal is to arrange blocks to spell a target word
; (i.e., a specific tower ordering).

(define (domain block-words)
  (:requirements :strips :typing :negative-preconditions)

  (:types block)

  (:predicates
    (on ?x - block ?y - block)     ; block x is directly on block y
    (ontable ?x - block)           ; block x is on the table
    (clear ?x - block)             ; nothing is on block x
    (holding ?x - block)           ; arm is holding block x
    (handempty)                    ; arm is not holding anything
  )

  (:action pick-up
    :parameters (?x - block)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (not (ontable ?x))
                 (not (clear ?x))
                 (not (handempty))
                 (holding ?x))
  )

  (:action put-down
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (not (holding ?x))
                 (clear ?x)
                 (handempty)
                 (ontable ?x))
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (not (holding ?x))
                 (not (clear ?y))
                 (clear ?x)
                 (handempty)
                 (on ?x ?y))
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and (holding ?x)
                 (clear ?y)
                 (not (clear ?x))
                 (not (handempty))
                 (not (on ?x ?y)))
  )
)

; problem
; Block Words Problem Instance 1
; 6 blocks: a, b, c, d, e, f (representing letters A-F)
; Initial state: blocks in a random arrangement on the table
; 20 candidate goals represent 20 different words/orderings

(define (problem blocks-problem-01)
  (:domain block-words)
  (:objects a b c d e f - block)

  (:init
    ; Random initial arrangement: all blocks on table, all clear
    (ontable a) (clear a)
    (ontable b) (clear b)
    (ontable c) (clear c)
    (ontable d) (clear d)
    (ontable e) (clear e)
    (ontable f) (clear f)
    (handempty)
  )

  ; Goal: spell word ABCDEF (a on b, b on c, c on d, d on e, e on f, f on table)
  (:goal
    (and
      (on a b)
      (on b c)
      (on c d)
      (on d e)
      (on e f)
      (ontable f)
    )
  )
)

; plan
1. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 1 of 6
2. (stack e f)
   deleted: (holding e) (clear f)
   added: (clear e) (handempty) (on e f)
   goals met: 2 of 6
3. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 2 of 6
4. (stack d e)
   deleted: (holding d) (clear e)
   added: (clear d) (handempty) (on d e)
   goals met: 3 of 6
5. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 3 of 6
6. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 4 of 6
7. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 4 of 6
8. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 5 of 6
9. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 6
10. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 6 of 6
